// 隐私政策文案
export const privacyContext = [
  '买家需在确认签收商品之日起7天内（按照物流签收后的第二天零时起计算时间，满168小时为7天）提出申请。',
  '药事云服务支持或卖家自行承诺提供无理由退货服务的商品，买家以无理由形式退货或拒签的，来回运费均由买家承担。若商品提供包邮服务，买家仅承担退货运费。',
  '如果是商品质量问题，收到的货物与网上描述不符而导致的退货，退货费用则应由卖家承担。',
  '申请金额仅以买家实际支付的商品价款为限。',
  '买家的赔付申请在形式上符合相关法律法规的规定。'
]

// 服务条款
export const serviceContext = [
  '买家需在确认签收商品之日起7天内（按照物流签收后的第二天零时起计算时间，满168小时为7天）提出申请。',
  '药事云服务支持或卖家自行承诺提供无理由退货服务的商品，买家以无理由形式退货或拒签的，来回运费均由买家承担。若商品提供包邮服务，买家仅承担退货运费。',
  '如果是商品质量问题，收到的货物与网上描述不符而导致的退货，退货费用则应由卖家承担。',
  '申请金额仅以买家实际支付的商品价款为限。',
  '买家的赔付申请在形式上符合相关法律法规的规定。'
]

// 邮费地址
export const region = ['江苏', '浙江', '山东', '安徽', '福建', '江西', '上海']

//
export const couponTab = [
  {
    key: 'canUsable',
    label: '可用优惠券'
  },
  {
    key: 'notUsable',
    label: '不可用优惠券'
  }
]

export const express = [
  {
    name: '普通快递',
    type: '1',
  },
  {
    name: '顺丰加急',
    type: '2',
  }
]

export const buyBtnText = {
  'hkk': '预约支付'
}