/**
 * 网络异常
 */

export const errorMsg = {
  900: '无效的登录',
  901: 'Token已过期',
  902: '非法JWT Token',
  903: '签名错误',

  1000: '不存在该分类',
  1001: '不存在该商品', // spu
  1002: '不存在该商品', // sku
  1003: '不存在该商品详情', // spu
  1004: '不存在该商品详情', // sku
  1005: '商品已经下架',
  1007: '商品已经下架',
  1008: '商品已经下架',

  2000: '不存在该订单',
  2001: '订单中缺少地址信息',
  2002: '正在创建订单',
  2003: '订单不存在或订单状态不允许被取消',
  2004: '不支持的订单事件',
  2005: '商品库存不足',
  2100: '无效的优惠券',
  2101: '不支持的优惠券类型',
  2102: '订单金额低于优惠券优惠条件',
  2104: '无效的优惠码',
  2105: '优惠券不可用',
  2106: '该优惠券已使用',
  2107: '计算订单总金额失败',
  2200: '支付进行中',
  2201: '退款进行中，退款单号为',
  2228: '商品最大购买数量超过限制',
  2202: '该订单不存在',
  2303: '订单状态已经发生变化，请刷新后重试',
  5005: '验证码错误',

  8000: '信息验证失败！',
  8001: '请求参数格式不合法',
  8002: '请求对象不存在',
  8003: '请求宝尊接口异常',

  9000: '微信登录请求异常',
  9001: '非法的小程序签名',
  9002: '统一下单失败',
  9003: '退款失败',
  9004: '关闭订单失败',

  10002: '用药人信息已被使用，不可以删除！',
  10003: '身份证与姓名不匹配',
  10004: '生日与身份证不匹配',
  10005: '身份证号已存在',

  11005: '不能使用两张同样的优惠券',
  11003: '券已领完，请关注后续活动消息',

  900004: '活动已删除'
}
